# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.

from random import randint

num = int(input('Введите кол-во кустов: '))

num_berries = [randint(1, 10) for _ in range(num)]
print(num_berries)

num_berries_left = num_berries[1:]
num_berries_left.extend(num_berries[:1])
print(num_berries_left)

num_berries_right = num_berries[-1:]
num_berries_right.extend(num_berries[:-1])
print(num_berries_right)

max_berries = max([num_berries[i] + num_berries_left[i] + num_berries_right[i] for i in range(len(num_berries))])

print('Макс-ое кол-во ягод за один заход равно: ', max_berries)
