# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
# повторениями). Выдать без повторений в порядке возрастания все те числа, которые
# встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
# элементов второго множества. Затем пользователь вводит сами элементы множеств.

from random import randint

num_1 = int(input('Введите кол-во элементов 1-го множества: '))
num_2 = int(input('Введите кол-во элементов 2-го множества: '))

set_1 = {randint(1, 20) for _ in range(num_1)}
print(set_1)

set_2 = {randint(1, 20) for _ in range(num_2)}
print(set_2)

print(sorted(set_1.intersection(set_2)))
print(sorted(set_1 & set_2))
